balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F5011.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2RX0B3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C2RX0B3" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D4" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D4" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB0D5" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0D40" edc:desc="" edc:mask="0x1" edc:name="TXB0D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D41" edc:desc="" edc:mask="0x1" edc:name="TXB0D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D42" edc:desc="" edc:mask="0x1" edc:name="TXB0D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D43" edc:desc="" edc:mask="0x1" edc:name="TXB0D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D44" edc:desc="" edc:mask="0x1" edc:name="TXB0D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D45" edc:desc="" edc:mask="0x1" edc:name="TXB0D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D46" edc:desc="" edc:mask="0x1" edc:name="TXB0D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D47" edc:desc="" edc:mask="0x1" edc:name="TXB0D47" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D50" edc:desc="" edc:mask="0x1" edc:name="TXB0D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D51" edc:desc="" edc:mask="0x1" edc:name="TXB0D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D52" edc:desc="" edc:mask="0x1" edc:name="TXB0D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D53" edc:desc="" edc:mask="0x1" edc:name="TXB0D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D54" edc:desc="" edc:mask="0x1" edc:name="TXB0D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D55" edc:desc="" edc:mask="0x1" edc:name="TXB0D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D56" edc:desc="" edc:mask="0x1" edc:name="TXB0D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D57" edc:desc="" edc:mask="0x1" edc:name="TXB0D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2RX0B4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C2RX0B4" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D6" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D6" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB0D7" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0D60" edc:desc="" edc:mask="0x1" edc:name="TXB0D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D61" edc:desc="" edc:mask="0x1" edc:name="TXB0D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D62" edc:desc="" edc:mask="0x1" edc:name="TXB0D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D63" edc:desc="" edc:mask="0x1" edc:name="TXB0D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D64" edc:desc="" edc:mask="0x1" edc:name="TXB0D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D65" edc:desc="" edc:mask="0x1" edc:name="TXB0D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D66" edc:desc="" edc:mask="0x1" edc:name="TXB0D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D67" edc:desc="" edc:mask="0x1" edc:name="TXB0D67" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D70" edc:desc="" edc:mask="0x1" edc:name="TXB0D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D71" edc:desc="" edc:mask="0x1" edc:name="TXB0D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D72" edc:desc="" edc:mask="0x1" edc:name="TXB0D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D73" edc:desc="" edc:mask="0x1" edc:name="TXB0D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D74" edc:desc="" edc:mask="0x1" edc:name="TXB0D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D75" edc:desc="" edc:mask="0x1" edc:name="TXB0D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D76" edc:desc="" edc:mask="0x1" edc:name="TXB0D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D77" edc:desc="" edc:mask="0x1" edc:name="TXB0D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------c---rnrr" edc:cname="C2RX0CON" edc:desc="" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------0---0000" edc:name="C2RX0CON" edc:nzwidth="0x10" edc:por="--------0---0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="JTOFF" edc:desc="" edc:mask="0x1" edc:name="JTOFF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DBEN" edc:desc="" edc:mask="0x1" edc:name="DBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FILHIT" edc:desc="" edc:mask="0x1" edc:name="FILHIT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXB0DBEN" edc:desc="" edc:mask="0x1" edc:name="RXB0DBEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
